<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="EnableSudo">Configure the behavior of the sudo command</string>
      <string id="EnableSudo_Help">This policy setting controls use of the sudo.exe command line tool.

If you enable this policy setting, then you may set a maximum allowed mode to run sudo in. This restricts the ways in which users may interact with command-line applications run with sudo. You may pick one of the following modes to allow sudo to run in:

"Disabled": sudo is entirely disabled on this machine. When the user tries to run sudo, sudo will print an error message and exit.

"Force new window": When sudo launches a command line application, it will launch that app in a new console window.

"Disable input": When sudo launches a command line application, it will launch the app in the current console window, but the user will not be able to type input to the command line app. The user may also choose to run sudo in "Force new window" mode.

"Normal": When sudo launches a command line application, it will launch the app in the current console window. The user may also choose to run sudo in "Force new window" or "Disable input" mode.

If you disable this policy or do not configure it, the user will be able to run sudo.exe normally (after enabling the setting in the Settings app).</string>
      <string id="Sudo_Disabled">Disabled</string>
      <string id="Sudo_ForceNewWindow">Force new window</string>
      <string id="Sudo_DisableInput">Disable input</string>
      <string id="Sudo_Normal">Normal</string>
    </stringTable>

    <presentationTable>
      <presentation id="EnableSudo">
        <dropdownList refId="SudoModes" noSort="true" defaultItem="0">Maximum allowed sudo mode</dropdownList>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
